src/main/resources/get-accounts.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://connect.avianis.com/Connect.asmx">
   <soapenv:Header>
      <con:AuthenticationHeader>
         <con:Username>#[sessionVars['avn-username']]</con:Username>
         <con:Password>#[sessionVars['avn-password']]</con:Password>
         <con:ConnectToken>#[sessionVars['avn-token']]</con:ConnectToken>
      </con:AuthenticationHeader>
   </soapenv:Header>
   <soapenv:Body>
      <con:GetAccounts/>
   </soapenv:Body>
</soapenv:Envelope>